{"class_name": "Model", "config": {"name": "model_74", "layers": [{"name": "input_134", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "name": "input_134"}, "inbound_nodes": []}, {"name": "input_133", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 5, 2, 1], "dtype": "float32", "sparse": false, "name": "input_133"}, "inbound_nodes": []}, {"name": "embedding_37", "class_name": "Embedding", "config": {"name": "embedding_37", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 6, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_134", 0, 0, {}]]]}, {"name": "flatten_72", "class_name": "Flatten", "config": {"name": "flatten_72", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_133", 0, 0, {}]]]}, {"name": "flatten_71", "class_name": "Flatten", "config": {"name": "flatten_71", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["embedding_37", 0, 0, {}]]]}, {"name": "multiply_37", "class_name": "Multiply", "config": {"name": "multiply_37", "trainable": true}, "inbound_nodes": [[["flatten_72", 0, 0, {}], ["flatten_71", 0, 0, {}]]]}, {"name": "sequential_66", "class_name": "Sequential", "config": {"name": "sequential_66", "layers": [{"class_name": "Dense", "config": {"name": "dense_166", "trainable": true, "batch_input_shape": [null, 10], "dtype": "float32", "units": 2392, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_160", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dense", "config": {"name": "dense_167", "trainable": true, "units": 2392, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_161", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"name": "dropout_105", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_168", "trainable": true, "units": 2392, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_162", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"name": "dropout_106", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_169", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "inbound_nodes": [[["multiply_37", 0, 0, {}]]]}], "input_layers": [["input_133", 0, 0], ["input_134", 0, 0]], "output_layers": [["sequential_66", 1, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}